Repository: lexoclub/klavaro-lexoclubmod
Catalog: po/*.po
Languages: sk

source: Klavaro - Progress
sk: Klavaro - Pokrok

source: _Lesson:
sk: _Lekcia:

source: Value
sk: Hodnota

source: Clear progress data.
sk: Vymazať údaje postupu.

source: _Reset
sk: _Vynulovať

source: Close this window, returning to the exercise.
sk: Zatvoriť toto okno a vrátiť sa k cvičeniu.

source: _Close
sk: _Zavrieť

source: everything!
sk: všetko!

source: Clear data for every module, if checked!
sk: Zmazať všetky údaje postupu vo všetkých moduloch!

source: Load other exercises/lessons
sk: Načítať iné cvičenia/lekcie

source: _Other texts
sk: _Iné texty

source: Edit the character set to be used in this lesson.
sk: Upraviť znakovú sadu použitú v tomto cvičení.

source: This is a specific exercise, adjusted to your error profile.
sk: Toto je cvičenie na precvičenie vašich chýb.

source: Edit the character set to be used in lessons after 43: they are customizable!
sk: Upraviť znakovú sadu použitú v lekciách po lekcii 43: sú užívateľsky upravovateľné!

source: Drag and drop text here to practice with it.
sk: Presuňte a pustite sem text, ktorý si chcete precvičiť.

source: Press here to restart the exercise. Hotkey: [Ctrl-R]
sk: Kliknite sem pre obnovenie cvičenia. Skratka: [Ctrl-R]

source: Show the virtual keyboard and the relation between fingers and keys.
sk: Zobraz virtuálnu klávesnicu a vzťahy medzi prstami a klávesmi.

source: _Keyboard
sk: _Klávesnica

source: Select the font to be used in the exercise window.
sk: Zvoľte si písmo, ktoré bude použité v okne s cvičením..

source: Font definition
sk: Definícia písma

source: Alternative color scheme, needs restart!
sk: Alternatívna farebná schéma, vyžaduje reštart okna cvičenia!

source: Co_urse information
sk: Informácie o k_urze

source: Charts showing the learning progress along the exercises.
sk: Grafy zobrazujúce postup učenia behom jednotlivých cvičení.

source: _Progress
sk: _Pokrok

source: Exit the application immediately.
sk: Ihneď ukončiť aplikáciu.

source: Return to the main menu.
sk: Vrátiť sa do hlavného menu.

source: B_ack to menu
sk: N_aspäť do menu

source: Show local and external scores from other users.
sk: Zobraziť lokálne a externé hodnotenia od ostatných používateľov.

source: Change language
sk: Zmeniť jazyk

source: Attention!
sk: Upozornenie!

source: Do you confirm?
sk: Súhlasíte?

source: _No
sk: _Nie

source: _Yes
sk: _Áno

source: Klavaro - Select file
sk: Klavaro - Vybrať súbor

source: _Cancel
sk: _Zrušiť

source: _Open
sk: _Otvoriť

source: Re_name:
sk: Preme_novať:

source: Rename the selected item.
sk: Premenovať vybrané položky.

source: Read a text file and add a copy of it here. The file must be encoded in UTF-8.
sk: Prečítať textový súbor a pridať jeho kópiu tu. Súbor musí byť vo formáte UTF-8.

source: _Open text file
sk: _Otvoriť textový súbor

source: Paste text that was copied to the clipboard.
sk: Prilepiť text, ktorý bol skopírovaný do schránky.

source: _Paste from clipboard
sk: _Prilepiť zo schránky

source: Remove the selected item.
sk: Vymazať označenú položku.

source: _Remove copied file
sk: ­Vymazať skopí_rované súbory

source: Apply the selected item to create an exercise.
sk: Vytvor cvičenie z označených položiek.

source: _Apply
sk: _Aplikovať

source: Close this window.
sk: Zatvoriť toto okno.

source: Country / Custom
sk: Krajina / vlastné

source: Remove the selected custom layout.
sk: Odstrániť označené vybrané rozloženie.

source: _Remove
sk: Odst_rániť

source: Toggles the shift effect on the keys. Alternates between the upper and lower characters of the keys.
sk: Stlačenie klávesu shift prepína medzi písaním malých a veľkých písmen.

source: SPACE BAR
sk: MEDZERNÍK

source: thumbs
sk: palce

source: Tab
sk: Tabulátor

source: S_ave as:
sk: Uložiť _ako:

source: Show previous screen.
sk: Zobraziť predchádzajúcu obrazovku.

source: _Previous step
sk: _Predchádzajúci krok

source: Show next screen.
sk: Zobraziť ďalšiu obrazovku.

source: _Next step
sk: _Nasledujúci krok

source: Return without any modification.
sk: Vrátiť sa bez akýchkoľvek zmien.

source: Save the current keyboard layout with the name specified above.
sk: Uložiť súčasné rozloženie klávesnice s menom zadaným vyššie.

source: _Save and use
sk: _Uložiť a použiť

source: If you like those beautiful hands, click here to close this window keeping them.
sk: Ak sa vám páčia tieto nádherné ruky, kliknite sem na zatvorenie okna s ponechaním rúk.

source: _Keep hands
sk: Ponechať ru_ky

source: Klavaro - Main menu
sk: Klavaro - hlavné menu

source: Don't be shy about learning the basics!
sk: Nehanbite sa naučiť základy!

source: Learn how to type correctly
sk: Naučte sa ako písať správne

source: Initial training for your fingers.
sk: Počiatočný tréning pre vaše prsty.

source: First steps with initial training
sk: Prvé kroky v počiatočnom tréningu

source: Memorizing the keyboard practicing random keys exercises.
sk: Naučenie sa klávesnice cvičením náhodných znakov.

source: Practice with random keys
sk: Cvičenie náhodných znakov

source: Accelerating the touches practicing random words exercises.
sk: Zvyšovanie rýchlosti cvičením náhodných slov.

source: Practice with random words
sk: Cvičenie s náhodnými slovami

source: Becoming proficient practicing complete paragraphs exercises.
sk: Staňte sa dokonalým(ou) precvičovaním celých odstavcov.

source: Practice with complete texts
sk: Cvičenie kompletných textov

source: Speech
sk: Diktovať

source: Your language here.
sk: Váš jazyk.

source: Keyboard layout for modules 1 and 2. Also used informatively in the fluidness contest.
sk: Rozloženie klávesnice pre moduly 1 a 2. Takisto používané pri teste plynulosti.

source: _Keyboard:
sk: _Klávesnica:

source: Language for modules 3 and 4.
sk: Jazyk pre moduly 3 a 4.

source: _Language:
sk: ­_Jazyk:

source: General information about the program.
sk: Všeobecné informácie o programe.

source: _About...
sk: O _aplikácii...

source: Yet another touch typing tutor
sk: Jednoducho ďalší program na naučenie sa písania

source: Remember always: someone loves you!
sk: Vždy si pamätajte: niekto vás má rád!

source: Show extra information.
sk: Zobraz doplňujúce informácie.

source: Hide extra information.
sk: Skry doplňujúce informácie.

source: Publish to the web your local scores.
sk: Zverejnite na web svoje lokálne skóre.

source: _Participate
sk: _Zúčastniť sa

source: Download from the web the most up to date ranking.
sk: Stiahnite si z webu najnovšie hodnotenia.

source: _Update
sk: Akt_ualizovať

source: A very flexible and efficient touch typing tutor.
sk: Veľmi flexibilný a efektívny program na naučenie sa písania.

source: (Custom)
sk: (Vlastné)

source: (Edit custom)
sk: (Uprav vlastné)

source: (Default)
sk: (Predvolené)

source: Dictation mode (depends on this speech synthesizer: %s)
sk: Režim diktovania (závisí od hlasového syntetizátoru: %s)

source: Introduction
sk: Úvod

source: Basic course
sk: Základný kurz

source: Adaptability
sk: Adaptabilita

source: Speed
sk: Rýchlosť

source: Fluidity
sk: Plynulosť

source: Keys:
sk: Znaky:

source: Connecting...
sk: Pripájam sa...

source: Overwrite user layout
sk: Prepísať používateľské rozloženie klávesnice

source: This will OVERWRITE an existent keyboard layout.
sk: Toto PREPÍŠE existujúce rozloženie klávesnice.

source: Remove user layout
sk: Odstrániť používateľské rozloženie klávesnice

source: This will REMOVE an existent keyboard layout.
sk: Toto ODSTRÁNI existujúce rozloženie klávesnice.

source: Reset progress data
sk: Vyresetovať údaje postupu

source: This will DELETE all the progress data of all modules.
sk: Toto VYMAŽE všetky údaje postupu zo všetkých modulov.

source: This will delete the data of this chart. <%s>
sk: Toto VYMAŽE údaje z tohto grafu. <%s>

source: This will delete the progress data of the module. (%s)
sk: Toto VYMAŽE údaje s postupom z modulu. (%s)

source: Accuracy
sk: Presnosť

source: (WPM)
sk: (slov/min)

source: Errors
sk: Chyby

source: Touch times (s)
sk: Čas dotyku (s)

source: Score
sk: Skóre

source: en
sk: sk

source: The basic course focuses on having you read the characters presented to you on screen and typing the corresponding keys. Remember to keep your hands correctly oriented on the home row of the keyboard at all times (see introduction on main menu).
sk: Základný kurz sa zameriava na čítanie písmen na obrazovke a písanie súvisiacich písmen. Nezabudnite mať ruky v správnej polohe celý čas (pozrite inštrukcie v hlavnom menu).

source: The key set used in each series will be shown in the above message line. The [Space], [Shift] and [Enter] keys may not show up there but are used very often.
sk: Skupina klávesov použitá v každej sérii sa bude zobrazovať v hornom informačnom riadku. [Medzerník], [Shift] a [Enter] nie sú zobrazované, ale sú používané veľmi často.

source: The message line below follows and echoes your key presses. If required, it changes and displays instructions for actions required from you.
sk: V spodnom informačnom riadku budú zobrazované stlačenia klávesov. Ak to bude potrebné, zobrazí inštrukcie pre akcie, ktoré budete musieť vykonať.

source: Here you may practice and improve your memorization of all keys. There will be sentences presented with nonsense words which mix some numbers and symbols.
sk: Tu môžete cvičiť a zlepšovať si zapamätanie rozloženia klávesnice. Budú tu vety s nezmyselnými slovami, v ktorých budú čísla a symboly.

source: In order to keep the lesson contents language and keyboard independent, accented letter combinations will probably not appear. For real word sentences, please use the fourth option of the main menu (about fluidness).
sk: Pre zachovanie nezávislostí lekcie na jazyku a rozložení klávesnice tu nebudú znaky s diakritikou. Pre písanie skutočných viet, prosím použite štvrtú možnosť v hlavnom menu (plynulosť).

source: After each exercise there will be a brief statistics panel reviewing your performance along with some relevant comments.
sk: Po každom cvičení tu bude krátka štatistika o vašom výkone s nejakým príslušným komentárom.

source: This exercise is very similar to the second one, for adaptability. The difference is that here you'll type real words.
sk: Toto cvičenie je veľmi podobné druhému, pre adaptabilitu. Rozdiel je, že tu píšete reálne slová.

source: The default language is the actual one of the interface. But you may select any other texts with words you would like to use. Press the 'Other' option above and add files containing those texts.
sk: Predvolený jazyk je rovnaký ako jazyk systému. Ale môžete si zvoliť akékoľvek iné texty so slovami, ktoré chcete písať. Stlačte "Iné" vyššie a pridajte textové súbory.

source: With this exercise the focus is on speed. So, you are supposed to type really fast and I will only flatter you when you deserve it!
sk: Toto cvičenie je zamerané na rýchlosť. Takže budete musieť písať veľmi rýchlo a ja vás odmením len vtedy, keď si to zaslúžite!

source: We will now use complete sentences and paragraphs which make logical sense. This may distract you while you type if you try to understand what you are entering. The previous exercises were aimed at getting you to type without interpreting and analyzing the content.
sk: Teraz tu budú celé vety a odseky, ktoré majú logický zmysel. Toto vás môže odpútavať pri písaní, ak sa budete snažiť porozumieť textu. Predchádzajúce cvičenia boli zamerané na písanie bez interpretácie a analýzy obsahu.

source: We do not mean to imply that the typists must behave like a robot, without understanding what they type. We do aim to develop the skill of typing, making it an automatic reflex akin to the acts of walking, talking, etc. After reaching this goal, the act of typing will become automatic and require little concentration. Then you will be able to pay attention to the real meaning of the text.
sk: To neznamená, že sa máte správať ako robot, bez pochopenia písaného textu. Ale mierime tým k vybudovaniu schopnosti písania podobnému automatického reflexu ako je kráčanie, rozprávanie sa atď. Po dosiahnutí tohto cieľa sa písanie stane automatickým a bude vyžadovať len malú pozornosť. Potom budete schopný(á) dávať pozor na zmysel textu.

source: These exercises are longer. Each exercise consists of three paragraphs and the emphasis is placed on correctness and rhythm, with a minimum speed requirement. Here you will be required to use the backspace key to correct any mistakes. In other words, only input without error will be accepted.
sk: Tieto cvičenia sú dlhšie. Každé cvičenie pozostáva z troch odsekov a dôraz je kladený na správnosť a rytmus, na rýchlosť len minimálne. Tu bude potrebné po chybe stlačiť tlačidlo Backspace a chybu opraviť. Inými slovami, len správny vstup bude uznaný.

source: Correct positioning of the hands and fingers is very important to efficient typing. You will learn faster and type better if you follow the next recommendations.
sk: Správna pozícia rúk a prstov je veľmi dôležitá pre efektivitu písania. Budete sa učiť rýchlejšie a písať lepšie, keď sa budete držať týchto odporúčaní.

source: The index-finger tips rest over each of the two keys which have a small raised mark, in the center of the keyboard.
sk: Ukazováky sa umiestňujú približne v strede klávesnice na klávesy označené malým výstupkom.

source: These marks function as 'tactile hooks' for your fingers to remain at the correct position. This way, with a little experience, you will not need to look at the keyboard to see if your fingers are properly positioned.
sk: Tieto značky fungujú ako "záchytné body" pre vaše prsty, aby zostali na správnej pozícií. Takto s trochou skúsenosti sa nebudete potrebovať pozerať na klávesnicu, aby ste sa presvedčili, že máte prsty správne umiestnené.

source: The tips of the other fingers lie naturally beside the index ones, over the keys on the same row of the keyboard.
sk: Ďalšie prsty sú prirodzene vedľa seba, v rade s ukazovákmi.

source: The outside edges of your thumbs rest over the space bar.
sk: Konce palcov sú nad medzerníkom.

source: The part of the hands closest to the wrist (the base) rest over the table, outside the keyboard. Without this kind of support the arms would quickly tire.
sk: Časť ruky pri zápästí sa opiera o stôl, mimo klávesnice. Bez tejto opory sa ruky rýchlo unavia.

source: This is referred to as the home position for the hands. From it the fingers move all over the keyboard, reaching all the keys as naturally and quickly as possible. To reach this goal one uses a specific relation between each key and finger. This relation will be learned gradually as you complete the basic course.
sk: Toto je základná poloha rúk. Odtiaľ sa prsty pohybujú po celej klávesnici, siahajúc po všetkých klávesoch prirodzene a najrýchlejšie. Preto sa využívajú vzťahy medzi každým klávesom a daným prstom. Tieto vzťahy sa naučíte postupne ako budete plniť základný kurz.

source: When learning the relation between fingers and keys, it is very important that you only move the finger which must press the key and allow all other fingers to remain in the home position.
sk: Keď sa učíte vzťahy medzi prstami a klávesmi, je veľmi dôležité, že budete pohybovať len prstom, ktorý musí stlačiť kláves a ponecháte ostatné prsty v základnej pozícií.

source: After memorizing this relationship, you can relax the previous rule some, so that you can attain greater speed while typing.
sk: Po zapamätaní si vzťahov, nemusíte predchádzajúci krok presne dodržiavať. Takto môžete dosiahnuť vyššie rýchlosti pri písaní.

source: The shift keys are used for capital letters and for some symbols. To get a shifted key input you should first use the small finger of the opposite hand. Just keep it in the closest Shift while reaching the target key with the other hand.
sk: Kláves shift (preraďovač) sa používa pre veľké písmená a niektoré znaky. Pre jeho použitie najprv použite malíček opačnej ruky, tzn. jedna ruka drží shift a druhá stláča písmeno. Drž shift pokiaľ stlačíte písmeno s druhou rukou.

source: You should be prepared to start training with the basic course. It will take effort and patience to be successful as a typist. We trust you have these and look forward to your success!
sk: Mali by ste byť pripravený(á) začať trénovať základný kurz. Nezabudnite, že budete potrebovať snahu a trpezlivosť, aby ste sa naučili písať všetkými desiatimi. Verím, že tieto hodnoty máte a teším sa na vaše úspechy!

source: Step %i
sk: Krok %i

source: To position the hands
sk: K umiestneniu rúk

source: Go ahead!
sk: Len do toho!

source: Click on any key to see which finger you must use:
sk: Klikni na akýkoľvek kláves, aby ste videli, ktorý prst použiť:

source: Relation between fingers and keys
sk: Vzťahy medzi prstami a klávesmi

source: Keyboard
sk: Klávesnica

source: Create or modify a custom keyboard layout
sk: Vytvor alebo uprav vlastné rozloženie klávesnice

source: small finger
sk: malíček

source: ring finger
sk: prstenník

source: middle finger
sk: prostredník

source: index finger
sk: ukazovák

source: Press and edit me
sk: Stlačte ma a upravte ma

source: Lesson:
sk: Lekcia:

source: Paragraphs:
sk: Odsekov:

source: Klavaro - Basic Course
sk: Klavaro - Základný kurz

source: Klavaro - Adaptability
sk: Klavaro - Adaptabilita

source: Adaptability exercises: automating the fingers responses, typing over all the keyboard.
sk: Cvičenia na adaptabilitu: zautomatizujte si reakcie prstov pri písaní po celej klávesnici.

source: Klavaro - Velocity
sk: Klavaro - Rýchlosť

source: Velocity exercises: accelerate typing real words.
sk: Cvičenia rýchlosti: zrýchlite si písanie skutočných slov.

source: Klavaro - Fluidness
sk: Klavaro - Plynulosť

source: Fluidness exercises: accuracy typing good sense paragraphs.
sk: Cvičenia plynulosti: presnosť písania zmysluplných odsekov.

source: End of exercise. Press [Enter] to start another.
sk: Koniec cvičenia. Stlačte [Enter] pre začatie ďalšieho.

source: Learning the key positions.
sk: Učenie sa rozmiestnenia kláves.

source: Press any key to start the exercise.
sk: Stlačte hocijaký kláves pre začatie cvičenia.

source: Start typing when you are ready.
sk: Začnite písať, keď budete pripravený(á).

source: Use backspace to correct errors.
sk: Použite backspace na opravu chýb.

source: ps.: logging not performed for this session: the number of typed characters (%i) must be greater than %i.
sk: P. S.: uloženie pre toto cvičenie nie je možné: počet zadaných znakov (%i) musí vyť väčší než %i.

source: ps.: you have entered the Top 10 list, great!
sk: P. S.: umiestnili ste sa v Top 10, skvelé!

source: ps.: the text you just typed doesn't seem to be similar to ordinary texts in the language currently selected: we can't account for it in the 'Top 10' contest.
sk: P. S.: text, ktorý ste práve napísali nevyzerá podobne ako bežné texty zvoleného jazyka: výsledok nie je možné započítať v „Top 10‟.

source: STATISTICS
sk: ŠTATISTIKY

source: Elapsed time:
sk: Ubehnutý čas:

source: minute and
sk: minúta a

source: second
sk: sekunda

source: Error ratio:
sk: Pomer chýb:

source: Accuracy:
sk: Presnosť:

source: Goal:
sk: Cieľ:

source: Characters per second:
sk: Znakov za sekundu:

source: (CPS)
sk: (zn/s)

source: Words per minute:
sk: Slov za minútu:

source: Fluidness:
sk: Plynulosť:

source: Comments:
sk: Komentáre:

source: space
sk: medzera

source: wye
sk: ypsilon

source: apostrophe
sk: apostrof

source: quote
sk: úvodzovka

source: Character
sk: Znak

source: Date & Time
sk: Dátum & Čas

source: This custom lesson is empty. You can define two or more different characters to generate a personal practice. Press the editting button in the upper-right corner.
sk: Táto vlastná lekcia je prázdna. Tu si môžete definovať 2 alebo viac rôznych znakov na vytvorenie cvičenia. Stlačte tlačidlo na úpravu v pravom hornom rohu.

source: Positions of keys seems to be learned!
sk: Zdá sa, že ste sa naučili rozmiestnenie kláves!

source: Congratulations! You have accomplished the entire basic course. Go to the next type of exercise: adaptability. There you will practice mainly the accuracy.
sk: Gratulujem! Splnili ste celý základný kurz. Choďte na ďalší typ cvičenia: adaptabilita. Tam budete cvičiť hlavne presnosť.

source: All right, now you got it! Go to the next lesson.
sk: V poriadku. teraz to už viete! Choďte na ďalšiu lekciu.

source: Your accuracy rate is below %.0f%%... Could you please try again to improve it?
sk: Váš pomer presnosti je pod %.0f%%... Môžete to prosím skúsiť ešte raz vylepšiť to?

source: You are doing well. But... Could you make the accuracy reach %.0f%%?
sk: Robíte to dobre. Ale... Mohli by ste dosiahnuť presnosť %.0f%%?

source: You are almost there, but your accuracy rate is still below %.0f%%. Try a few more times, or maybe you're getting upset, so go to another kind of exercise.
sk: Ste skoro tam, ale váš pomer presnosti je stále pod %.0f%%. Vyskúšajte to ešte párkrát viac. Alebo sa možno stávate rozrušeným, tak choďte na iný typ cvičenia.

source: Very good! You succeeded with an accuracy rate above %.0f%%. Now it is time to increase your velocity. Go to the 3rd exercise at the main menu.
sk: Veľmi dobre! Zvládli ste to s pomerom presnosti nad %.0f%%. Teraz je čas zlepšiť svoju rýchlosť. Choďte na 3. cvičenie v hlavnom menu.

source: Pasted_or_dropped
sk: Vložené_alebo_pustené

source: You are just beginning. Be patient, try it again every day, rest and don't worry so much: persistence and practice will improve your velocity.
sk: Ste ešte len na začiatku. Buďte trpezlivý, skúste to znova každý deň, oddychujte a neobávajte sa veľmi: vytrvalosť a cvičenie zlepšia vašu rýchlosť.

source: Still away from the highway. You can do better... Try to reach at least %.0f WPM.
sk: Stále ďaleko od hlavného prúdu. Určite môžete písať lepšie... Skúste dosiahnuť aspoň %.0f slov za minútu.

source: You are doing well, but need to go faster. And don't forget the accuracy. Try to get %.0f WPM.
sk: Ide vám to dobre, ale potrebujete ísť rýchlejšie. A nezabudnite na presnosť. Skúste dosiahnuť %.0f slov za minútu.

source: Fine. Now you need to start running. Can you reach %.0f WPM?
sk: Dobre. Teraz sa potrebujete rozbehnúť. Môžete dosiahnuť %.0f slov za minútu?

source: Very good. You are almost there. Can you finally reach %.0f WPM?
sk: Veľmi dobre. Ste skoro tam. Môžete konečne získať %.0f slov za minútu?

source: Excellent. For this course, that is enough. Try now the fluidness exercises, OK?
sk: Vynikajúcu. Pre tento kurz, toto je dostatočné. Teraz skúste cvičenia plynulosti. OK?

source: Fast! Are you a professional? So, try to get %.0f WPM!
sk: Rýchle! Ste profesionál? Tak skúste %.0f slov za minútu!

source: Ranking good, Speed Racer! Are you afraid of reaching %.0f WPM?
sk: Dobré umiestnenie, ste rodený pretekár! Neobávate sa dosiahnuť %.0f slov za minútu?

source: Kung-fu mastery! Can you fly at %.0f WPM?
sk: Majster Kung-fu! Môžete vyletieť na %.0f slov za minútu?

source: Dvorak master! I have no words to express my admiration!
sk: Majster Dvorak! Nemám žiadne slová na vyjadrenie mojej poklony!

source: You type accurately but not so fast. Can you reach %.0f WPM?
sk: Píšete presne, ale nie tak rýchlo. Môžete dosiahnuť %.0f slov za minútu?

source: Your rhythm is not so constant. Calm down. For now, try to make the fluidness greater than %i%%.
sk: Váš rytmus nie je konštantný. Upokojte sa. Nateraz, skúste mať plynulosť vyššiu než %i%%.

source: You are almost getting there. Type more fluently. I want a fluidness greater than %.0f%%.
sk: Skoro sa tam dostávate. Píšte viac plynulejšie. Chcem plynulosť vyššiu než %.0f%%.

source: Congratulations! It seems to me that you are a professional. You don't need this program (me) anymore. Hope you have enjoyed. Thanks and be happy!
sk: Gratulujem! Tak sa mi zdá, že ste profesionál. Už nepotrebujete tento program a mňa. Verím, že ste si to užili. Ďakujem a buďte šťastný!
