Repository: lexoclub/klavaro-lexoclubmod
Catalog: po/*.po
Languages: sk

source: How can you type so fast? You have exceeded all my expectations. Are you a machine? Could you teach me? I can not help you anymore. Go to an expert!
sk: Ako môžete písať tak rýchlo? Prekonali ste všetky moje očakávania. Ste stroj? Mohli by ste ma učiť? Už vám nemôžem pomôcť. Choďte za expertom!

source: Name
sk: Meno

source: Chars
sk: Znakov

source: When
sk: Kedy

source: Local scores
sk: Lokálne skóre

source: External scores
sk: Externé skóre

source: Empty ranking. Please practice fluidness.
sk: Hodnotenie je prázdne. Cvičte prosím plynulosť.

source: Not able to download files
sk: Nemožno stiahnuť súbory

source: not found
sk: nenájdené

source: Are you sure you have it installed in your system?
sk: Ste si istý, že to máte nainštalované na svojom systéme?

source: Could not download file from the host server.
sk: Nemožno stiahnuť súbory zo serveru.

source: Not able to upload files
sk: Nemožno nahrať súbory

source: Could not upload/download scores.
sk: Nemožno stiahnuť/nahrať skóre.
